//Приклад 1
     #include <stdio.h>
     int main() {
    int a = 017;  // 017 відповідає 15 у десятковій системі
    int b = 036;  // 036 відповідає 30 у десятковій системі

    // Побітове І
    int bitwise_and = a & b;
    printf("a & b = %o\n", bitwise_and);  // %o для виводу у вісімковій системі

    // Побітове АБО
    int bitwise_or = a | b;
    printf("a | b = %o\n", bitwise_or);

    // Зсув вправо на 2 (тільки для змінної a)
    int left_shift_a = a >> 2;
    printf("a >> 2 = %o\n", left_shift_a);
}
//---------------------------------------------------------------------------------------------------------------
//a & b = 16
//a | b = 37
//a << 2 = 3
//Приклад 2
1)	Переведення значень змінних a= 017, b=036 з вісімкової у двійкову систему числення:
a = 017 (вісімкова) = 000 001 111 (двійкова)
b = 036 (вісімкова) = 011 110 (двійкова)

2)Виконання необхідних операцій:
*Побітове І (a & b):
000 001 111
& 000 011 110
000 001 110

*Побітове АБО (a | b):
000 001 111
| 000 011 110
000 011 111

*Зсув вліво на 2 (тільки для a) (a << 2):
000 001 111 << 2 = 000 111 100

*Зсув вправо на 2 (тільки для a) (a >> 2):
000 001 111 >> 2 = 000 000 011

3)Отже, результати операцій для змінних a та b:

a & b = 000 001 110 (вісімкова: 016)
a | b = 000 011 111 (вісімкова: 037)
a << 2 = 000 111 100 (вісімкова: 074)
a >> 2 = 000 000 011 (вісімкова: 003)
//Приклад 3
#include <stdio.h>
#include<conio.h>
main() {
int a=0,b=3,c;
c=b%2 ||(a>=0)&&(++b/2*a)==0;
printf("a=%d, c=%d\n",a,c);
getch();
}
//---------------------------------------------------------------------------------------------------------
//a=0, c=1
//Приклад 4
#include <stdio.h>
#include<conio.h>
main() {
int a=1,b=0,c;
c=b%2 ||(a>=0)&&(++b*a)==0;
printf("c=%d\n",c);
getch();
}
//---------------------------------------------------------------------------------------------------------
//c=0
//Приклад 5
#include <stdio.h>
#include<conio.h>
main() {
int x=2,z,y=0;
z=(x==0)&&(y=x) ||(y>0);
printf("z=%d\n",z);
getch();
}
//---------------------------------------------------------------------------------------------------------
//z=0

